app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "description", "address", "phone", "category", "capacity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
  	@restaurant = Restaurant.new(restaurant_params)

  	if @restaurant.save